fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>InformationRegister.ВКМ_ГрафикОтпусков</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>DefinedType.ФизическоеЛицо</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДнейОтпуска</name>
      <type>
        <types>DefinedType.ВКМ_Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбщееКоличествоДнейОтпуска</name>
      <type>
        <types>DefinedType.ВКМ_Количество</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников

&НаКлиенте
Процедура ОтпускаСотрудниковДатаНачалаПриИзменении(Элемент)
	
	ПодсчетКоличестваДнейОтпуска(Элементы.ОтпускаСотрудников.ТекущиеДанные);

КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДатаОкончанияПриИзменении(Элемент)
	
	ПодсчетКоличестваДнейОтпуска(Элементы.ОтпускаСотрудников.ТекущиеДанные);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьФормуАнализГрафика(Команда)
	
	Адрес = ПоместитьГрафикВоВременноеХранилище();
	
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("АдресДанныеГрафика", Адрес);
	
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ПараметрыОткрытияФормы);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПодсчетКоличестваДнейОтпуска(СтрокаТЧ)

	ДлительностьОтпускаСотрудникаВСекундах = СтрокаТЧ.ДатаОкончания - СтрокаТЧ.ДатаНачала;	
	СтрокаТЧ.КоличествоДнейОтпуска = ДлительностьОтпускаСотрудникаВСекундах / (24 * 60 * 60);
	
	ПараметрыОтбора = Новый Структура();
	ПараметрыОтбора.Вставить("Сотрудник", СтрокаТЧ.Сотрудник);
	
	СтрокиПоСотруднику = Объект.ОтпускаСотрудников.НайтиСтроки(ПараметрыОтбора);
	КоличествоДнейОтпускаВсего = 0;
	Для Каждого Строка Из СтрокиПоСотруднику Цикл
	
		КоличествоДнейОтпускаВсего = КоличествоДнейОтпускаВсего + Строка.КоличествоДнейОтпуска;		
		
	КонецЦикла;
	
	Для Каждого Строка Из СтрокиПоСотруднику Цикл
	
		Строка.ОбщееКоличествоДнейОтпуска = КоличествоДнейОтпускаВсего;	
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПоместитьГрафикВоВременноеХранилище()
	
	Данные = РеквизитФормыВЗначение("Объект.ОтпускаСотрудников").Выгрузить();
	
	Адрес = ПоместитьВоВременноеХранилище(Данные);
	
	Возврат Адрес;
	
КонецФункции

#КонецОбласти
